## *1. Data pre-processing*
Also known as data cleaning or wrangling <br>
*The process of converting or mapping data from the initial "Raw" for into another format, in order to prepare teh data for further analysis.*

### **Learning Objectives**
- Identify and handle missing values
- Data Formating
- Data normalization(centering/scaling)
- Data Binning
- Turning categorical Data into Numeric variables

*df["Symbling"] = df["symboling"]+1*

## *2. Missing values*
What is missing value?<br>
*Missing value occur when no data value is stored for a variable (feature) in an observation* <br>
*Could be represented as "?", "N/A", 0 or just a blank cell* <br>

### **How to deal with missing data?**
**Check with teh data collection source**
**Drop the missing values**
- Drop the variable
- Drop the data entry
**Replace the missing values**
- replace it with an average
- replace it by frequency
- replace it based on other functions
**Leave it as missing data**

### **How to drop missing values**
Use df.dropna():
|highway-mpg | price |
|----------| ------ |
| ... | ....
| 20 | 23875 
|22 | NaN 
| 29 | 16430
| ... | ...

**axis = 0** drops entire row <br>
**axis = 1** drops entire column

|highway-mpg | price |
|----------| ------ |
| ... | ....
| 20 | 23875 
| 29 | 16430
| ... | ...


df.dropna(subset = ['price'], axis = 0, inplace = True) <br>
here inplace means this will directly modify the dataset otherwise it can be done by <br>
df = df.dropna(subset = ['price'], axis = 0) <br>
df.dropna(subset= ['Price'], axis = 0) this doesnt change dataset

### **How to replace missing values in Python**
Use df.replace(missing_value, new_value) <br>
mean = df['normalized_losses'].mean() <br>
df['noramlized_losses'].replace(np.nan, mean)

### **Data Formatting**
- Data is usually collected from different palces and stored in different formats
- Bringing data into a common standard of expression allows users to make meaningful comparison
**Not-formatted:**
  - confusing
  - hard ot aggregate
  - hard to compare
| city |
|------ |
| N.Y.
| NY
| Ny
| New York

**Formatted:**
- more cleaer
- easy to aggreagate
- easy to compare
| city |
| ---- |
| New York
| New York
| New York
| New York

### **Applying calculations to an etire column**
*Let's take data for distance covered by car on litters of fuel at city we ask perfoma people calculate mile per gallon "mpg" but we need in L/100km so we would do this*
<br>
df["city_mpg"] = 235/df["city_mpg"] <br>
Now lets change the column name as well <br>
df.rename(columns = {"city_mpg": "city_L/100km"}, inplace = True)

### **Correcting data types**
To identify data types:
- df.dtypes <br>
To convert
- df.astype() <br>

df['price'] = df['price'].astype('int')

### **Data Normalizations**
- Uniform the features values with different raneg.
| scale | [150, 250] | [50, 100] | [50, 100] |
| ------ | ----------| -------- | ----------- |
| imapact | large | small | small |

**Not_Normalized**
- "age" and "icome" are in different range.
- hard to compare
- "income" will iflunce the result more intrinisicaly

| age | income | 
| ----- | ---- |
| 20 | 10000 |
| 30 | 20000 |
| 40 | 500000 |

**Normalized**

| age | income |
| ----| ------ |
| 0.2 | 0.2 |
| 0.3 | 0.04 |
| 0.4 | 1 |

### **Methods of normalizating data**
Several approaches for normalization:
1. Simple Feature scaling
<br>
x(new) = x(old) / x(max)

2. Min - min
<br>
x(new) = x(old) - x(min) / x(max) - x(min)

3. Z-score
<br>
x(new) = x(old) - meo / std

**Examples**
#### 1. Simple feature scalling

df["length"] = df["length"] / df["length"].max()
<br>
<br>

#### 2. Max - min

df['lenght'] = (df['length'] - df['length'].min()) / (df['lenght'].max() - df['lenght'].min())
<br>
<br>

#### 3. Z-score

df['length'] = (df['lenght'] - df['lenght'].mean()) / df['lenght'].std()
<br>

### **Binning**
- Binning: Grouping of values into bins"
- Convererts numeric into categorical variables
- Group a set of numerical values into a set of "bins"
- "price" is an feature range from 5000 to 45000

| Price | 5000 - 10000 | 11000 - 30000 | 31000 - 45000 |
| ----- | ------------ | -------------- | ---------- |
|bins: | Low | Mid | High

bins = np.linspace(min(df["price"]),max(df["price"], 4)<br><br>
group_names = ["Low", "Medium", "High"] <br><br>
df["price-binned"] = pd.cut(df["price"], bins, labels = group_names, include_lowest = True) <br><br>

### **Turing Categorical Variables into Quantitative Variables in Python**
Problem: 
- Most statistical models cannot take in the objects/strings as input
| Car | Fuel | ... |
| ----|------|-----|
| A | gas | ... |
| B | diesel | ... |
| C | gas | ... |
| D | gas | ... |

Assign 0 0r 1 in each category
| Car | Fuel | ... | gas | diesel |
| ----|------|-----| ---- | ---- |
| A | gas | ... | 1 | 0
| B | diesel | ... | 0 | 1
| C | gas | ... | 1 | 0
| D | gas | ... | 1 | 0

pd.get_dummies(df['fuel'])

In [3]:
import pandas as pd
Data = { "Fuel": ["gas", "diesel", "gas", "gas"]}
df = pd.DataFrame(Data)
df.head()

     Fuel
0     gas
1  diesel
2     gas
3     gas

In [4]:
# Now lets create its its dummies converting categorical data into numeric values
pd.get_dummies(df['Fuel'])

   diesel    gas
0   False   True
1    True  False
2   False   True
3   False   True

In [1]:
import pandas as pd
data = pd.read_csv("E:\\titanic.csv")
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [2]:
data['fare'].max()

512.3292

In [3]:
data['fare'].min()

0.0

In [4]:
import numpy as np

In [5]:
bins = np.linspace(min(data['fare']), max(data['fare']), 4)

In [8]:
group_names = ['low', 'medium', 'high']
data['fare_binned'] = pd.cut(data['fare'], bins, labels = group_names, include_lowest = True)
data.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,fare_binned
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,low
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,low
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,low
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,low
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,low

In [9]:
data.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,fare_binned
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",medium
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",low
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",low
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",low
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",low
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY",low
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",low
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI",low
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",low
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay",low